app/controllers/orders_controller.rb

  def new
    @order = Order.new
    @products = Product.all
---
SELECT "products".* FROM "products"

  def create
    @order = Order.new(order_params)
    @products = Product.all

    respond_to do |format|
      if @order.save
---
SELECT "products".* FROM "products"
INSERT INTO "orders" ("customer_id", "product_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 1], ["product_id", 1], ["description", "adsadsads"], ["created_at", "2021-12-13 12:54:12.129970"], ["updated_at", "2021-12-13 12:54:12.129970"]]